hybridMultiphaseFoamV7/tutorials/Free_Flow_Cases/Capillary_Rise/standard_Boundary/0/alpha.wetting
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.1                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      alpha.wetting;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   nonuniform List<scalar> 
8000
(
1
1
1
1
1
1
1
1
...
)
;

boundaryField
{
    atmosphere
    {
        type            zeroGradient;
    }
    walls
    {
        type            constantAlphaContactAngle;
        theta0          45;
        limit           gradient;
        value           nonuniform List<scalar> 
800
(
1
1
1
1
1
1
1
1
...
)
;
    }
    inlet
    {
        type            inletOutlet;
        inletValue      uniform 1;
        value           uniform 1;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
